In [145]:
import requests
import pandas as pd
import numpy as np
from datetime import datetime
import os

In [146]:
symbol = input("Symbol = ")

start_date = input(f"Start date = (YYYY-MM-DD)").strip()
start_date = start_date.split("-")
start_date = [int(item) for item in start_date]

to_date = input(f"To date = (YYYY-MM-DD)").strip()
to_date = to_date.split("-")
to_date = [int(item) for item in to_date]

interval = input("""interval = 
                 
                ONE_MINUTE = "1"
                FIVE_MINUTES = "5"
                FIFTEEN_MINUTES = "15"
                THIRTY_MINUTES = "30"

                ONE_HOUR = "1H"

                ONE_DAY = "1D"
                ONE_WEEK = "1W"
                ONE_MONTH = "1M"
                 """).strip()
query_string = {
    'symbol': symbol, 
}
query_string["resolution"] = interval
query_string["from"] = str(datetime(start_date[0], start_date[1], start_date[2]).timestamp())
query_string["to"] = str(datetime(to_date[0], to_date[1], to_date[2]).timestamp())

In [147]:
query_string

{'symbol': 'VNINDEX',
 'resolution': '1D',
 'from': '946659600.0',
 'to': '1732640400.0'}

In [148]:
headers = {'accept': 'application/json, text/plain, */*',
           'accept-encoding': 'gzip, deflate, br, zstd',
           'accept-language': 'en-US,en;q=0.9',
           'origin': 'https://iboard.ssi.com.vn',
           'priority': 'u=1, i',
           'referer': 'https://iboard.ssi.com.vn/',
           'sec-ch-ua': '"Not/A)Brand";v="8", "Chromium";v="126", "Microsoft Edge";v="126"',
           'sec-ch-ua-mobile': '?0',
           'sec-ch-ua-platform': '"Windows"',
           'sec-fetch-dest': 'empty',
           'sec-fetch-mode': 'cors',
           'sec-fetch-site': 'same-site',
           'user-agent': 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/126.0.0.0 Safari/537.36 Edg/126.0.0.0'}

In [149]:
url_without_params = 'https://iboard-api.ssi.com.vn/statistics/charts/history'

In [150]:
response = requests.get(
    url=url_without_params,
    headers=headers,
    params=query_string
)

In [151]:
response.status_code

200

In [152]:
df = pd.DataFrame(response.json()["data"])

In [153]:
df

               t        c        o        h        l          v   s
0      964742400   100.00   100.00   100.00   100.00       4200  ok
1      965001600   101.55   101.55   101.55   101.55      10300  ok
2      965174400   103.38   103.38   103.38   103.38        300  ok
3      965347200   105.20   105.20   105.20   105.20       3800  ok
4      965606400   106.92   106.92   106.92   106.92      13200  ok
...          ...      ...      ...      ...      ...        ...  ..
5910  1732060800  1216.54  1203.71  1222.73  1197.99  649274185  ok
5911  1732147200  1228.33  1217.30  1228.55  1214.06  427350380  ok
5912  1732233600  1228.10  1228.95  1233.42  1226.33  453742385  ok
5913  1732492800  1234.70  1229.39  1236.57  1229.02  409112104  ok
5914  1732579200  1242.13  1235.63  1246.83  1235.22  503889875  ok

[5915 rows x 7 columns]

In [154]:
df['t'] = pd.to_datetime(df['t'], unit='s').dt.strftime('%m-%d-%Y 00:00:00+00:00')
df['t'] = pd.to_datetime(df['t'])

In [155]:
df

,t,c,o,h,l,v,s
0,2000-07-28 00:00:00+00:00,100.00,100.00,100.00,100.00,4200,ok
1,2000-07-31 00:00:00+00:00,101.55,101.55,101.55,101.55,10300,ok
2,2000-08-02 00:00:00+00:00,103.38,103.38,103.38,103.38,300,ok
3,2000-08-04 00:00:00+00:00,105.20,105.20,105.20,105.20,3800,ok
4,2000-08-07 00:00:00+00:00,106.92,106.92,106.92,106.92,13200,ok
...,...,...,...,...,...,...,...
5910,2024-11-20 00:00:00+00:00,1216.54,1203.71,1222.73,1197.99,649274185,ok
5911,2024-11-21 00:00:00+00:00,1228.33,1217.30,1228.55,1214.06,427350380,ok
5912,2024-11-22 00:00:00+00:00,1228.10,1228.95,1233.42,1226.33,453742385,ok
5913,2024-11-25 00:00:00+00:00,1234.70,1229.39,1236.57,1229.02,409112104,ok
5914,2024-11-26 00:00:00+00:00,1242.13,1235.63,1246.83,1235.22,503889875,ok

In [156]:
df.rename(
    columns={
        "t": "Date",
        "c": "Close",
        "o": "Open",
        "h": "High",
        "l": "Low",
        "v": "Volume"
    },
    inplace=True
)
df.drop(columns=["s"], inplace=True)

In [157]:
df

                          Date    Close     Open     High      Low     Volume
0    2000-07-28 00:00:00+00:00   100.00   100.00   100.00   100.00       4200
1    2000-07-31 00:00:00+00:00   101.55   101.55   101.55   101.55      10300
2    2000-08-02 00:00:00+00:00   103.38   103.38   103.38   103.38        300
3    2000-08-04 00:00:00+00:00   105.20   105.20   105.20   105.20       3800
4    2000-08-07 00:00:00+00:00   106.92   106.92   106.92   106.92      13200
...                        ...      ...      ...      ...      ...        ...
5910 2024-11-20 00:00:00+00:00  1216.54  1203.71  1222.73  1197.99  649274185
5911 2024-11-21 00:00:00+00:00  1228.33  1217.30  1228.55  1214.06  427350380
5912 2024-11-22 00:00:00+00:00  1228.10  1228.95  1233.42  1226.33  453742385
5913 2024-11-25 00:00:00+00:00  1234.70  1229.39  1236.57  1229.02  409112104
5914 2024-11-26 00:00:00+00:00  1242.13  1235.63  1246.83  1235.22  503889875

[5915 rows x 6 columns]

In [158]:
df["Date"].min()

Timestamp('2000-07-28 00:00:00+0000', tz='UTC')

In [159]:
df["Date"].max()

Timestamp('2024-11-26 00:00:00+0000', tz='UTC')

In [160]:
symbol = symbol.replace(".", "_").lower()

In [161]:
min_date = df["Date"].min().date()
max_date = df["Date"].max().date()
folder_save = f"../../data/{symbol}"
os.makedirs(folder_save, exist_ok=True)
file_name = f"{folder_save}/{symbol}_to_now_{interval.lower()}.csv"

In [162]:
file_name = file_name.replace("-", "_")

In [163]:
file_name

'../../data/vnindex/vnindex_to_now_1d.csv'

In [164]:
df.to_csv(file_name, index=False)